{"basics":{"name":"Sandeep Venkataram","label":"Computational Biologist","image":"","email":"sandeep.venkataram [at] gmail","url":"https://sandeepvenkataram.github.io/","summary":"A computational biologist using genomics and data science to improve human health.","location":{"city":"Redwood City","countryCode":"US","region":"California"},"profiles":[{"network":"Google Scholar","username":"Sandeep Venkataram","url":"https://scholar.google.com/citations?user=JQgejuMAAAAJ&hl=en"},{"network":"Linkedin","username":"Sandeep Venkataram","url":"https://www.linkedin.com/in/sandeepvenkataram/"}]},"work":[{"name":"Hexagon Bio","position":"Computational biologist","url":"https://www.hexagonbio.com/","startDate":"2023-05","endDate":"Present","summary":"Developed custom bioinformatic solutions for building a phylogeny across 75k genomes and analyzing 1000+ chemical-genetic screens / week along with supporting laboratory R&D efforts"},{"name":"University of California, San Diego","position":"Postdoctoral scholar","url":"https://www.sklab.science/","startDate":"2016-10","endDate":"2022-10","summary":"Developed an engineered microbial community suitable for quantifying the effect of species interactions on the repeatability of evolution. Discovered a novel evolutionary phenomenon, which we named 'evolutionary stalling'","highlights":["4 Peer-reviewed first-author publications, including publications in PNAS and Nature Ecology and Evolution"]}],"volunteer":[{"organization":"Society for Molecular Biology and Evolution","position":"Conference Symposium organizer and chair","startDate":"2018","summary":"Drafter and submitted a symposium proposal for the SMBE 2018 meeting. Invited a keynote speaker, reviewed abstract submissions and selected oral and poster contributions to the symposium. I then chaired the symposium during the meeting."},{"organization":"Biomedical Computation at Stanford","position":"Conference co-organizer","startDate":"2012","summary":"As part of a 5-person steering committee, was involved in all aspects of putting on the conference including fundraising and organizing the venue, advertising, selecting speakers, organizing the program and managing the event."},{"organization":"Regional Intel Science Fair","position":"Category Judge","startDate":"2011-2025","summary":"I have consistently volunteered as a category judge at the Santa Clara and San Diego middle / high school science fairs."}],"education":[{"institution":"Stanford University","location":"Stanford, CA","url":"https://www.stanford.edu/","area":"Evolutionary Biology","studyType":"PhD","startDate":"2010-09","endDate":"2016-08"},{"institution":"Washington Unviersity in St. Louis","location":"St. Louis, MO","url":"https://www.wustl.edu/","area":"Biology, 2nd major in Computer Science","studyType":"<A","startDate":"2006-08","endDate":"2010-05"}],"awards":[{"title":"Best Contributed Oral Presentation","date":"2019","awarder":"Evolution of Complex Life Conference","summary":"Awareded one of two awards for best oral presentation at the conference.'"},{"title":"Finalst - Early Independence Award (DP5)","date":"2018","awarder":"NIH","summary":"THe DP5 is a nationally competitive award for early academics. I was invited to present my work in front of the granting body at Washington DC.'"},{"title":"Runner-up, Crow Award","date":"2016","awarder":"Genetics Society of America","summary":"The crow award is the premier award for recent PhD graduates in evolutionary genetics given by GSA. I was invited to prsent my work at a plenary session at the annual meeting.'"}],"publications":[{"name":"Mutualism-enhancing mutations dominate early adaptation in a two-species microbial community","publisher":"Nature Ecology and Evolution","releaseDate":"2023","url":"https://www.nature.com/articles/s41559-022-01923-8"},{"name":"Evolutionary stalling and a limit on the power of natural selection to improve a cellular module","publisher":"Proceedings of the National Academy of Sciences","releaseDate":"2020","url":"https://www.pnas.org/doi/abs/10.1073/pnas.1921881117"},{"name":"Hidden complexity of yeast adaptation under simple evolutionary conditions","publisher":"Current Biology","releaseDate":"2018","url":"https://www.cell.com/current-biology/fulltext/S0960-9822(18)30011-3"},{"name":"Development of a comprehensive genotype-to-fitness map of adaptation-driving mutations in yeast","publisher":"Cell","releaseDate":"2016","url":"https://www.cell.com/cell/fulltext/S0092-8674(16)31010-8"}],"skills":[{"name":"NGS Analysis","keywords":["- Developed custom python software to process raw Illumina reads from amplicon sequencing of DNA-barcoded mutant libraries, used by researchers at Stanford, UC San Diego and Arizona State (Nature Ecology and Evolution 2023).","- WGS variant calling pipelines identifying SNPs, InDels and structural variants from short-read sequencing data (Cell 2016).","- Time-series metagenomic variant calling (PNAS 2020)."]},{"name":"Other Bioinformatics and Data Analysis","keywords":["- Constructed and analyzed a large-scale phylogenetic tree from sequencing data (50,000+ genomes)","- Parametric and Non-Parametric statistical analysis of biological data, with an emphasis on error modeling and FDR control","- Development of computational workflows in SnakeMake that were executed in a cloud-computing environment (Google Cloud)"]},{"name":"Cross-Functional Collaboration","keywords":["With 2 years of industry experience in cross-functional teams and 12 years of academic experience in designing and executing experiments with both wet-lab and computational components, I have extensive experience working in a cross-functional environment developing bioinformatic solutions in a manner that is cognizant of wet-lab limitations"]},{"name":"Communication","keywords":["- Published original research in high-profile scientific journals including Nature, Nature Ecology and Evolution, Cell, Current Biology, PNAS and Philosophical Transactions B","- Contributed oral presentations at 11 national and international scientific conferences","- Synthesized hundreds of scientific articles while writing two peer-reviewed review papers","- Collaborated extensively with diverse researchers including mathematicians, microbiologists and evolutionary biologists"]},{"name":"Software Tooling","keywords":["- Programming Languages: Highly proficient: Python, Functionally proficient: R, C++, Java, Perl","- Python Packages: Pandas, Numpy, Scipy, Bokeh, Seaborn, MatPlotLib, Dash, Jupyter Notebook","- Computing Environments: Google Cloud, HPC (Slurm), Unix / Linux","- Other Tooling: Docker, Git, Github"]}]}